src/main/resources/xml/SampleWeb/getArray/getArray.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:smar="http://smartbear.com">
   <soapenv:Header/>
   <soapenv:Body>
      <smar:GetArray/>
   </soapenv:Body>
</soapenv:Envelope>