zerocode-rest-help/src/test/resources/soap/soap1.2_endpoint_object_type_response_500.json

{
    "scenarioName": "GIVEN a SOAP 1.2 end point WHEN I invoke a method with a request XML, THEN I will get response XML Type",
    "steps": [
        {
            "name": "invoke_object_type",
            "url": "http://secure.smartbearsoftware.com/samples/testcomplete12/webservices/Service.asmx",
            "operation": "POST",
            "request": {
                "headers": {
                    "Content-Type": "application/soap+xml; charset=utf-8"  //<--- careful about this
                },
                "body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <GetSampleObject xmlns=\"http://smartbear.com\">\n      <no>int</no>\n    </GetSampleObject>\n  </soap12:Body>\n</soap12:Envelope>"
            },
            "assertions": {
                "status" : 500,
                "rawBody": "$CONTAINS.STRING:System.Web.Services.Protocols.SoapException: Server was unable to read request."

            }
        }
    ]
}
